plugins/load_test/translation_server_load_test.yml
config:
  target: "http://localhost:8094"
  payload:
    - path: "translations.csv"
      fields:
        - "translation"
    - path: "schema.csv"
      fields:
        - "code"
        - "geom"
    - path: "osm.csv"
      fields:
        - "osm"
    - path: "translated.csv"
      fields:
        - "trans"
        - "body"
    - path: "bulkTranslations.csv"
      fields:
        - "osmTrans"
        - "osmBody"
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 25
      name: "Warm up the application"
    - duration: 600
      arrivalRate: 25
      name: "Sustained max load"
scenarios:
  - name: "capabilities"
    weight: "2"
    flow:
    - get:
        url: "/capabilities"
  - name: "translateTo"
    weight: "20"
    flow:
    - post:
        url: "/translateTo?translation={{translation}}"
        headers:
          Content-Type: "text/xml"
        body: "{{osm}}"
  - name: "translateFrom"
    weight: "16"
    flow:
    - post:
        url: "/translateFrom?translation={{trans}}"
        headers:
          Content-Type: "text/xml"
        body: "{{body}}"
  - name: "getSchema"
    weight: "20"
    flow:
      - get:
          url: "/translateTo?idelem=fcode&idval={{code}}&geom={{geom}}&translation={{translation}}"
  - name: "bulkTranslateTo"
    weight: "1"
    flow:
      - post:
          url: '/translateTo?translation={{osmTrans}}'
          headers:
            Content-Type: "text/xml"
          body: "{{osmBody}}"